"use client";

import { useState, useRef } from "react";
import { Swiper, SwiperSlide } from "swiper/react";
import { Navigation } from "swiper/modules";
import "swiper/css";
import "swiper/css/navigation";
import {
  FaMobileAlt,
  FaInfoCircle,
  FaArrowLeft,
  FaArrowRight,
} from "react-icons/fa";

const slides = [
  {
    title: "یکپارچگی داده‌ها و هماهنگی فعالیت‌ها",
    text: `سیستم‌ مدیریت وظایف ما به‌عنوان یک جزء از سیستم‌های یکپارچه ایمن پرداز عمل کرده و وظایف و پروژه‌ها را به‌طور خودکار از داده‌های مختلف در سیستم های یکپارچه ایمن پرداز دریافت میکند. به‌عنوان‌مثال، وظایف مرتبط با سفارشات تأمین کالا یا فرآیندهای تولید می‌توانند مستقیماً از سیستم های یکپارچه به سیستم مدیریت وظایف منتقل شده و به تیم‌های مختلف ابلاغ شوند. این امر باعث بهبود هماهنگی و کاهش خطاهای انسانی می‌شود.`,
  },
  {
    title: "اتوماسیون فرآیندها",
    text: `سیستم‌ های اتوماسیون اداری و مالی ایمن پرداز و سیستم‌ مدیریت وظایف ما می‌توانند به‌صورت مکمل عمل کنند. برای مثال، در یک فرآیند تأسیس پروژه، پس از تصویب یا دریافت درخواست از بخش‌های مختلف، سیستم اتوماسیون اداری می‌تواند وظایف مرتبط را به‌طور خودکار در سیستم مدیریت وظایف ایجاد کند و به افراد مربوطه اختصاص دهد. این کار باعث می‌شود که مراحل مختلف بدون نیاز به مداخلات دستی و با سرعت بیشتری پیش بروند.`,
  },
  {
    title: "پیگیری و گزارش‌دهی",
    text: `ارتباط این سیستم‌ باعث می‌شود که اطلاعات دقیق‌تری از وضعیت پیشرفت پروژه‌ها و وظایف به دست آید. به‌عنوان‌مثال، گزارش‌های وضعیت انجام وظایف که در سیستم مدیریت وظایف ثبت می‌شوند، می‌توانند به سیستم های یکپارچه اتوماسیون اداری و مالی ایمن پرداز ارسال شوند تا مدیران از پیشرفت‌ها، تأخیرها و مشکلات احتمالی آگاه شوند. این نوع گزارش‌دهی به‌طور خودکار می‌تواند به تصمیم‌گیری‌های مدیریتی کمک کند.`,
  },
  {
    title: "بهبود بهره‌وری",
    text: `با ارتباط مستقیم سیستم مدیریت وظایف ما با سیستم‌های یکپارچه اتوماسیون اداری و مالی ایمن پرداز ، بسیاری از فرآیندها می‌توانند به‌طور خودکار و بدون نیاز به مداخلات دستی انجام شوند. این امر به‌ویژه در سازمان‌های بزرگ با فرآیندهای پیچیده اهمیت دارد، زیرا می‌تواند بهره‌وری کلی سازمان را به‌شدت افزایش دهد. از طرفی دیگر، انجام وظایف با دقت بیشتر و بدون اتلاف زمان باعث کاهش هزینه‌ها و بهبود کیفیت کار می‌شود.`,
  },
  {
    title: "مدیریت منابع انسانی و وظایف مرتبط",
    text: `یکی از کاربرد اصلی سیستم‌ مدیریت وظایف ما در ارتباط با سیستم های یکپارچه اداری و مالی ایمن پرداز، مدیریت منابع انسانی است. این سیستم‌ می‌توانند اطلاعات مربوط به کارکنان، مهارت‌ها و وظایف مختلف را به‌طور یکپارچه در اختیار مدیران قرار دهد. به‌عنوان مثال، مدیر پروژه می‌تواند با استفاده از داده‌های سیستم های یکپارچه ما ، وظایف را به اعضای تیم اختصاص دهد و آن‌ها را با توجه به مهارت‌ها، سابقه کاری و بار کاری فعلی‌شان تخصیص دهد.

`,
  },
  {
    title: "تسهیل در نظارت و ارزیابی عملکرد",
    text: `با اتصال سیستم مدیریت وظایف ما به سیستم‌های اتوماسیون اداری و مالی ایمن پرداز ، مدیران می‌توانند به‌راحتی عملکرد کارکنان را بر اساس پیگیری و تکمیل وظایف ارزیابی کنند. این اطلاعات می‌توانند به‌عنوان داده‌های ارزشمندی برای تحلیل کارایی کارکنان و بهبود فرآیندها مورد استفاده قرار گیرند.`,
  },
  {
    title: "نتیجه استفاده از سیستم های یکپارچه ایمن پرداز",
    text: `ارتباط میان سیستم مدیریت وظایف ما و سیستم‌های یکپارچه و اتوماسیون اداری و مالی ایمن پرداز می‌تواند به سازمان‌ها در دستیابی به کارایی بیشتر، کاهش خطاها، بهبود هماهنگی میان بخش‌های مختلف و تسریع در فرآیندها کمک کند. این ارتباط باعث می‌شود که اطلاعات در سرتاسر سازمان به‌طور یکپارچه جریان یابد و فرآیندهای مدیریتی و اجرایی به شکل مؤثرتری انجام شوند.`,
  },
];

export default function MeetingsSlider() {
  const swiperRef = useRef(null);
  return (
    <div className="max-w-6xl mx-auto relative  pb-2 pt-4">
      <div className="flex justify-between mb-4">
        <button
          onClick={() => swiperRef.current?.slidePrev()}
          className="flex items-center gap-2 bg-gray-800 hover:bg-gray-700 text-[#49C5B6] p-3 cursor-pointer rounded-full transition"
        >
          <FaArrowRight />
        </button>
        <button
          onClick={() => swiperRef.current?.slideNext()}
          className="flex items-center gap-2 bg-gray-800 hover:bg-gray-700 text-[#49C5B6] px-3 cursor-pointer rounded-full transition"
        >
          <FaArrowLeft />
        </button>
      </div>

      <Swiper
        modules={[Navigation]}
        spaceBetween={30}
        slidesPerView={1}
        loop
        autoHeight={true} 
        onSwiper={(swiper) => {
          swiperRef.current = swiper;
        }}
        pagination={{ clickable: true }}
      >
        {slides.map((slide, index) => (
          <SwiperSlide key={index}>
            <div className="bg-gray-900 text-gray-100 px-1 md:px-3 lg:px-4 py-2 md:py-3 lg:py-5 rounded-xl shadow-lg relative">
              <h3 className="text-xs md:text-sm lg:text-base font-bold flex items-center gap-2 mb-3">
                <FaMobileAlt className="text-[#49C5B6]" />
                {slide.title}
              </h3>
              <p className="text-gray-300 whitespace-pre-line mb-4 text-justify font-medium text-xs md:text-sm leading-relaxed">
                {slide.text}
              </p>
            </div>
          </SwiperSlide>
        ))}
      </Swiper>
    </div>
  );
}
