const cards = [
  {
    id: 1,
    img: "/images/c1.jpg",
    alt: "راه اندازی سیستمهای یکپارچه",
    date: " ۲۶ آذر ۱۴۰۳",
    title: "راه اندازی سیستمهای یکپارچه",
    description:
      "راه اندازی سیستمهای یکپارچه اداری و مالی و شهر سازی در شهرداری پارس آباد و سازمان حمل و نقل پارس اباد",
    link: "/cards/1",
    content:
      "سیستمهای یکپارچه اداری و مالی آفیس یار يك تفكر، فناوري و سيستمي براي مديريت موثرتر تمام منابع در يك سازمان می باشد. آفیس یار به سازمانها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و به واسطه يكپارچگي تمام اطلاعات در ميان فرايندهاي كاري مختلف هزينه ها را كاهش داده و كارايي را افزايش ‌دهند.",
    comments: [
      {
        id: 1,
        author: "مهدی",
        date: "۲۷ آذر ۱۴۰۳",
        text: "خیلی مقاله خوبی بود",
        replies: [
          { id: 1, author: "سارا", date: "۲۸ آذر ۱۴۰۳", text: "موافقم، خیلی مفید بود!" },
        ],
      },
      {
        id: 2,
        author: "سارا",
        date: "۲۸ آذر ۱۴۰۳",
        text: "مطالب کاملاً مفید بود، ممنون!",
        replies: [],
      },
    ],
  },
  {
    id: 2,
    img: "/images/c2.jpg",
    alt: "راه اندازی سیستمهای یکپارچه",
    date: " ۲۶ آذر ۱۴۰۳",
    title: "راه اندازی سیستم های یکپارچه",
    description:
      "راه اندازی سیستمهای یکپارچه اداری و مالی در شهرداری سرعین و سازمان آتش نشانی شهرداری سرعین",
    link: "/cards/2",
    content:
      "در نتيجه راه حل سيستمهاي ERP راه حل مناسب را فراهم كرده و اطلاعات و سرويسهاي مربوط به دپارتمانهاي سرتاسر يك سازمان را يكپارچه مي نمايند. اين راه حل به سازمانها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و به واسطه يكپارچگي تمام اطلاعات در ميان فرايندهاي كاري مختلف هزينه ها را كاهش داده و كارايي را افزايش ‌دهند.",
    comments: [
      {
        id: 1,
        author: "علی",
        date: "۲۷ آذر ۱۴۰۳",
        text: " سازمان را يكپارچه مي نمايند. اين راه حل به سازمانها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و به واسطه يكپارچگي تمام اطلاعات در ميان فرايندهاي كاري" ,
        replies: [
          { id: 1, author: "نرگس", date: "۲۹ آذر ۱۴۰۳", text: "دقیقا، مفید بود" },
          { id: 2, author: "مهدی", date: "۳۰ آذر ۱۴۰۳", text: "نها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و  نها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و نها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و  نها اجازه مي‌دهد كه تمام منابع‌شان را بهتر اداره كنند و بدينوسيله و " },
        ],
      },
    ],
  },
  {
    id: 3,
    img: "/images/c3.jpg",
    alt: "راه اندازی سیستمهای یکپارچه",
    date: " ۲۶ آذر ۱۴۰۳",
    title: "راه اندازی اتوماسیون اداری",
    description:
      "راه اندازی اتوماسیون اداری و مالی بصورت یکپارچه در شرکت خدمات بیمه ای امید مشاور",
    link: "/cards/3",
    content:
      "سازمان هاي امروزي در جهت جهاني شدن رقابت مي كنند به طوري كه  اين رقابت به سطوح بي سابقه اي رسيده است. در بازارهاي رقابت جهاني ، سازمانها به يافتن راه حل هاي كسب و كاري بهتر با ساختارهاي انعطاف پذير و قابل اطمينان تر نياز دارند. بسياري از زيرساختارهاي سازماني و تشكيلاتي توسط سيستم هاي اطلاعاتي (كه فرايندهاي كاري را بطور مستقيم و يا غير مستقيم در جهت رشد و ابقاء سازمان پشتيباني مي كنند) توانمندتر شده اند. با اداره مؤثرتر اين فرايندها مزاياي رقابتي مي توانند از طريق كاهش هزينه ، افزايش توليد و بهبود سرويس دهي مشتريان حاصل شوند. در دو دهه گذشته گرايش خاصي به راه حلي متمركز كه فرايندهاي كاري را بهبود مي دهند ايجاد شده است.",
    comments: [
      {
        id: 1,
        author: "رضا",
        date: "۲۸ آذر ۱۴۰۳",
        text: "اطلاعات خیلی جامع بود",
        replies: [],
      },
      {
        id: 2,
        author: "مریم",
        date: "۳۰ آذر ۱۴۰۳",
        text: "خیلی عالی توضیح داده شده",
        replies: [
          { id: 1, author: "علی", date: "۳۰ آذر ۱۴۰۳", text: "موافقم با مریم" },
          { id: 2, author: "حامد", date: "۳۰ آذر ۱۴۰۳", text: "مرسی" },
        ],
      },
    ],
  },
    {
    id: 4,
    img: "/images/c3.jpg",
    alt: "راه اندازی سیستمهای یکپارچه",
    date: " ۲۶ آذر ۱۴۰۳",
    title: "راه اندازی اتوماسیون اداری",
    description:
      "راه اندازی اتوماسیون اداری و مالی بصورت یکپارچه در شرکت خدمات بیمه ای امید مشاور",
    link: "/cards/3",
    content:
      "سازمان هاي امروزي در جهت جهاني شدن رقابت مي كنند به طوري كه  اين رقابت به سطوح بي سابقه اي رسيده است. در بازارهاي رقابت جهاني ، سازمانها به يافتن راه حل هاي كسب و كاري بهتر با ساختارهاي انعطاف پذير و قابل اطمينان تر نياز دارند. بسياري از زيرساختارهاي سازماني و تشكيلاتي توسط سيستم هاي اطلاعاتي (كه فرايندهاي كاري را بطور مستقيم و يا غير مستقيم در جهت رشد و ابقاء سازمان پشتيباني مي كنند) توانمندتر شده اند. با اداره مؤثرتر اين فرايندها مزاياي رقابتي مي توانند از طريق كاهش هزينه ، افزايش توليد و بهبود سرويس دهي مشتريان حاصل شوند. در دو دهه گذشته گرايش خاصي به راه حلي متمركز كه فرايندهاي كاري را بهبود مي دهند ايجاد شده است.",
    comments: [
      {
        id: 1,
        author: "رضا",
        date: "۲۸ آذر ۱۴۰۳",
        text: "اطلاعات خیلی جامع بود",
        replies: [],
      },
      {
        id: 2,
        author: "مریم",
        date: "۳۰ آذر ۱۴۰۳",
        text: "خیلی عالی توضیح داده شده",
        replies: [
          { id: 1, author: "علی", date: "۳۰ آذر ۱۴۰۳", text: "موافقم با مریم" },
          { id: 2, author: "حامد", date: "۳۰ آذر ۱۴۰۳", text: "مرسی" },
        ],
      },
    ],
  },
  
];

export default cards;
